import { defineStore } from 'pinia'

export const useGeneralStore = defineStore('general',{
    state:()=>({
        searchkey: '',
        searchchoice:'关键词',
        SiteList:[
            {
                "name": "安吉县吴昌硕纪念馆",
                "content": "吴昌硕(1844-1927)，名俊、俊卿，字昌硕，别号缶庐、苦铁、大聋，浙江省安吉县人。吴昌硕诞生在苦难深重的旧中国，青少年时期即逢战乱，辗转逃亡，历尽艰险。中年时期过着“饥看天”的窘迫生活，一生饱经风霜，而这正是其艺术得以深广博大的生活基础，时代造就了这位巨人，竖起了中国美术史上的一座丰碑，对后世产生了深远的影响。家乡人民为纪念这位杰出的艺术家，于1986年建成了吴昌硕纪念馆，1998年吴昌硕纪念馆新馆交付使用，新馆座落在昌硕公园内，馆舍与环境融为一体。纪念馆共有展厅面积500平方米，二楼设有《吴昌硕生平图片展》及《吴昌硕作品展》，一楼为临时展厅，可供举办各类展览，馆内藏有吴昌硕的书画印章、诗文信札、生前用物，其后人、弟子以及当代知名书画家的作品。纪念馆编辑出版了《馆藏吴昌硕作品集》、《吴昌硕》等。吴昌硕纪念馆已成为安吉县对外交流的窗口和爱国主义教育基地。<!--advertisement code begin--><!--advertisement code end--><!--function: content() parse end  0ms cost! -->",
                "province": "浙江",
                "city": "湖州"
            },
            {
                "name": "安吉",
                "content": "安吉地处长江三角洲经济区，杭嘉湖平原西北部，是全国著名的竹乡，县内环境保护良好，森林覆盖率达70%，是全国生态示范县。<br> 安吉县面积1886平方公里，人口45万，辖10镇7乡，县城递铺镇。全县旅游交通十分便利。离上海220公里、杭州64公里，距苏南、无锡、常州及南京等地均在200公里内，东为莫干山，西南为天目山，其主峰为县境内龙王山，是苏南浙北地区最高峰，也是黄浦江之源头。 安吉县有极为丰富的旅游资源。全县境内山峦叠障，绿荫环抱，山青水秀，林海茫茫，森林覆盖率达到65%，是一个天然的绿色世界。“川原五十里，修竹半其间”，举世无双的万倾竹海孕育出竹文化、竹风情，赋予安吉旅游独特的迷人魅力。坐落在海拔900多米山巅的天荒坪抽水蓄能电站是目前亚洲最大、世界第二大抽水蓄能电站，以此为中心的天荒坪风景名胜区，目前正在申报国家级风景名胜区。整个电站工程气势宏伟，巧夺天工；湖光山色，相得益彰，堪称天下一绝。1996年11月国务院外办主任刘华秋陪同李鹏总理、吴邦国副总理来安吉视察，曾留下“雾漫天荒坪，人在天上行；山隐竹林中，湖在青山顶”的美句。占地1200亩，拥有300多种竹种的安吉竹种园，被国内外专家公认为世界最大、品种最全的“世界竹子王国”。省级自然保护区龙王山是黄浦江源头，以物种丰富而闻名，山间石林叠浪，奇松环抱，云海雾岚，野物活跃，是生态旅游的绝佳去处。安吉是由国家文化部命名的“中国民间书画之乡”。我国近代艺术大师吴昌硕先生出生于安吉，先生集诗书画印于一身，在中国艺术史上享有极高地位，被尊为“一代宗师”，日本称其为“中国画圣”；他在国内的弟子潘天寿、沙孟海、齐白石、刘海粟等皆为书画大家。而今，大师故里书画遗风长存，书画事业方兴未艾，人才辈出，仅省以上书协、美协会员就达数十位之多。此外，境内千年古刹灵峰寺钟鼓悠远，明代安吉古城墙完整无损，灵芝塔、云鸿塔千年屹立巍峨，天赋度假村湖光山色迷人，形成了一条集观光旅游、休闲度假为一体的黄金旅游线。近年来，安吉充分利用独特的旅游资源优势，制定了建设“都市后花园”和“旅游大县”的战略目标，确定了“一环、二区、一中心”的旅游框架。“一环”即历史文化民众风情旅游环；“两区”即天荒坪旅游区和龙王山旅游区；“一中心”即把县城递铺镇建成旅游综合服务中心，并相继举办了97中国竹文化节、98天荒坪之光旅游节、99中国竹乡生态旅游节，推出了天荒坪风光游、黄浦江寻源生态游和昌硕文化游三条旅游热线。<br>  人文景观有文天祥驻守抗元的独松关、千年名刹灵峰寺、五代古迹灵芝塔、一代艺术大师吴昌硕的纪念馆、故居等。出生于安吉鄣吴的吴昌硕先生，熔诗、书、画、印于一炉，在中国艺术史上享有极高的地位，被尊为“一代宗师”，日本称其为“中国画圣”。县内名刹灵峰寺自梁代建寺始，就是文人墨客聚集之地。元代著名文学家、书法家杨椎桢曾隐居在此；佛教最大宗派――净土宗的第九代祖师、明代“四大高僧”之一、灵峰寺主持藕益大师在灵峰寺留下佛学经典之作《灵峰宗论》，并在该寺圆寂。坐落在海拔900多米山巅的天荒坪抽水蓄能电站气势宏伟，巧夺天工，湖光山色，相得益彰，堪称天下一.  安吉钟灵毓秀，得天独厚，素有“竹乡”之称，是国家命名的“中国竹乡”和“中国竹子之乡”。竹林面积98万亩，其中毛竹林77万亩，小竹林21万亩，毛竹蓄积量1.35亿支，居全国十大“竹子之乡”之首。近年来，安吉围绕竹类资源开发做文章，实施贸工农和外向型发展战略，竹业经济发展迈出了可喜步伐。竹类资源开发已形成竹凉席、竹胶板、竹装饰板、竹工艺品、竹保健品、竹文体用品、竹中间体等七大系列700多个品种，产品远销东南亚、欧美等20多个国家和地区。到1999年底止，全县已发展各类竹制品加工企业1200多家，其中三资企业30家，竹类资源加工产值突破17亿元，在全国处于领先地位。安吉还有丰富的土特产资源，有“老三宝”——笋干、板栗、山核桃和“新三宝”——白茶、白果、竹黄酮。全县共有茶园6.7万亩，年产茶叶3300多吨，为浙江省主要产茶县之一。“安吉白茶”为安吉独有的名茶极品，“安吉白片”为全国名茶，“天坛”牌特级珍眉茶曾荣获国际金奖，“高山云雾茶”也是个中珍品。新近研制开发的国家级新产品——竹叶黄酮，可代替银杏黄酮，在降血脂、降血压、抗疲劳、防衰老等方面具有明显功效，开发前景十分广阔。",
                "province": "浙江",
                "city": "湖州"
            },
            {
                "name": "安吉竹博园",
                "content": " 安吉竹子博览园前身为安吉竹种园，位于中国著名竹乡--浙江省安吉县境内，它是集竹文化、竹工艺于一体的中国竹子博物馆和亚洲规模最大的安吉竹种园的完美结合，整个竹博园是融科研、生产、生态、旅游等诸多功能为一体的竹类大观园。素有\"都市后花园\"之美称的安吉竹博园，全园总占地面积600亩，汇集了大江南北，海内外竹子34个属304个品种。<br>安吉竹种园是1974年由中国林科院亚林所、安吉县林业局、灵峰寺林场三家单位共同建成的，最初是竹子科研和生产基地。在科研上，安吉竹种园先后同浙江林学院、省林科所、南京林业大学等科研机构和高等院校协作，进行了竹子系统分类、竹子引种驯化、珍稀竹种繁育技术等多项竹类课题研究，取得了一定成果；在生产上，接待大批国内外观、考察人员，并向全国十几个省、市数千家单位提供材用、笋用、观赏用竹苗，并承接各种社区、单位的绿化工程。九十年代初，安吉竹种园积极发展旅游业，投入了数千万元的建设资金，修建了园中苑、咏竹廊、观竹楼、竹志岛、大型温室、修竹湖、生态广场等园林小品和一大批亭、台、楼、阁，可谓小桥流水，曲径通幽。特别是2000年10月建成开馆的中国竹子博物馆，是目前中国唯一一家竹子专业博物馆。博物馆总占地面积12000平方米，分历史资源、栽培利用、文学艺术、学术报告、工艺集萃、国际交流等展厅。在这里，可以通过丰富的展品，翔实的史料和高科技多媒体设备，了解竹文化国度--中国悠久的竹历史、光辉灿烂的竹文化和改革开放以来，我国竹产业的迅速发展情况。<br>国家领导人李鹏、乔石、宋平、吴邦国、邹家华等先后视察本园。国际竹藤组织及数十个国家和地区每年有大批的专家、学者慕名前来竹子博览园参观考察。泰竹：别名：南洋竹、条竹。秆丛密，高7-13米，径3-6厘米，秆壁甚厚，几实心。竹姿优美，优良庭园、盆栽观赏竹种，杆可作家具柄、烟嘴等工艺品。<br>分布：云南、广东、福建。慧竹：别名：四时竹、寒山竹、笔竹。秆高2.5-4米，径约1厘米，节间13-15厘米，秆箨纸资，淡绿色，或多或少具黄褐色细点；箨叶直立，三角状披针形，绿色，边缘染紫色。<br>分布：浙江、上海、广东等地。 橄榄竹：别名：江南竹。秆高8-17米，径达10厘米，节间长约60厘米，新秆粉绿色，被白粉，节下尤密；老秆黄绿色，秆环隆起具脊；叶片长披针形，长8-10厘米。竹秆挺拔秀丽，作观赏或整秆材用均可。<br>分布：浙江、福建。 凤尾竹：秆密丛生，矮细但空心，秆高1-3米，枝纤叶小，风起似凤尾，姿态优美。利用其枝纤叶小，低矮密丛生的形态，用于布置庭园作矮绿篱。筇竹：别名：罗汉竹、宝塔竹、算盘竹。秆高达6米，径1-3厘米，节间长10-25厘米；箨环为隆起而呈一显著之园脊，犹如两盘相扣合，中有环状缝线；秆箨紫红色或紫色带绿，页狭披针形。秆节奇形，枝叶纤细，为优良的观赏竹种，秆宜作拐杖、工艺品。笋肉厚、资脆、味美，多制做笋干外销。<br>分布：四川、贵州方竹：别名四季竹、四方竹、四角竹。秆高3-8米，径1-4厘米，世界著名珍稀竹种。秆下方而上圆，秆基部略呈方形。适合于庭院点缀或盆栽。秆可作手仗。<br>分布：浙江、江西、福建、湖南、广西等地。 茶秆竹：别名：青篱竹、沙白竹、亚白竹。秆劲直，高7-13米，径4-6米，秆环平滑箨环线状凸起，幼时被一圈栗色刺毛。叶片厚而坚韧，窄长披针形，长18-35厘米，宽2-4厘米。<br>竹材通直、节平、坚韧，为我国传统出口商品，宜作滑雪杆、钓鱼杆、雕刻、家具等。<br>分布：广东、福建、湖南、广西等地。龙竹：别名：印度麻竹、大麻竹。秆高达30米，径10-30厘米，节间长30-40厘米，幼时覆有一层白色腊粉，旰箨早落，初淡紫色，背面具暗褐色刺毛，叶片矩圆状披针形，长15-45厘米，宽3-6厘米。为良好的建筑、篾用竹种。<br>分布：云南南部及西南部。广广西有引种栽培。 菲白竹：矮小竹种，秆高0.2-0.8米，径0.1-0.2厘米，节间圆筒形，秆环平。叶片绿色而具明显的白色或淡黄色条纹。<br>园林或盆栽观赏。<br>分布：原来产日本。我国江浙及上海等地引种栽培。大明竹：秆高3-4米，径0.5-1.5米，新秆绿黄色，无毛；箨环平，节下具有白粉圈。箨鞘绿色至绿黄色，短于节间，上被白色脱落性小刺毛；箨叶窄披针形，直立或开展；叶片线状披针形，资厚，长15-25厘米。<br>枝叶纤细下垂，作庭园绿化甚佳。<br>分布：广东、福建、江苏、浙江、上海等均有栽培。",
                "province": "浙江",
                "city": "湖州"
            },
            {
                "name": "安吉藏龙百瀑",
                "content": " 藏龙百瀑（又名太平天国“小梁山”）距县城18公里，南连临安“小九寨沟”风景区，西与世界第二、亚洲第一的天荒坪抽水蓄能电站相连，湖州通向临安的临青省道横穿藏龙百瀑景区，藏龙百瀑景区方园30多平方公里，进入景区沿途两岸千米高山对峙，森林茂密，路边飞瀑流泉，可见悬崖叠障，奇峰林立，瞬间迎面而翠竹连绵。藏龙百瀑是浙江最大的瀑布群，有三折重叠，落差为60多米的“长龙飞瀑”，有彩虹横卧的“ 虹贯龙门”（人称小黄果树），更有神形皆备的“神龟听瀑”——真可谓瀑瀑相连，一步一景。藏龙百瀑不仅以瀑布众多而闻名，同时还有一块万吨巨石在七千万年前就悬挂在两座悬崖之间，人称“仙人桥”，有千钧一发之险，望仙石、老鹰石、天生悬石，石石相望，形象逼真。俗话说深山藏宝，景区内有多种野生动物和近百种国家保护树种。夏天天气凉爽，宁静幽雅，有十里不打伞之奇，峡谷无蚊之妙；冬天百瀑冰凌，天造奇观，雪景迷人，堪称“江南哈尔滨”。从山顶俯瞰，只见一个山谷，口狭肚大，呈宝葫芦形，山谷之中有一村落，名为“藏龙山寨”。<br>藏龙百瀑景区内的藏龙山寨，村子不大，约300余人，建村历史不长，仅两百年左右。据当地老人介绍，该村祖先与兵家有着千丝万缕的关系。村中居民以李、翁、施三姓为主，祖先均为太平军余部。由于山寨位于湖州、临安两市交界处，成了兵家割据一隅的理想场所。因七千万年前的冰川运动，在两市交界处形成了悬崖峭壁、易守难攻的地理位置，成为兵家屯兵扎寨的首选之地。藏龙百瀑地势之险以长龙山为最，据史料记载，19世纪中叶，忠王李秀成率领的太平军在长龙山上演绎了一场“长毛战清妖”的英雄故事，那高山之中的层层梯田是太平天国“天朝田亩制度”佐证，那“太平洞”是当年太平军打造兵器的“兵工厂”，那“看灯台”是太平军将士用以观察敌情的“哨所”。在“一夫当关，万夫莫开”的长龙山上，太平军将士用他们的铮铮铁骨、盖天豪情坚持战斗了四年零五个月，谱写了一曲撼天动地的壮丽悲歌，为中国历史写上了辉煌的一笔。后为纪念太平天国将士的英雄业绩，改长龙山为太平天国“小梁山”。<br> 藏龙百瀑景区内物产丰富，尢以四大“仙物”闻名，其一谓“仙茶”，岩上沃地、茶叶满枝、滋味甘醇、清香浓郁，在遍缀山坡的野生茶园里有一株“白茶王”。传说这株白茶王古称“仙草茶”。家住杭州西湖的白娘娘为救夫命去南方仙境盗仙草，在盗得仙草后被白鹤童子发现。白娘娘边战边逃，慌乱中来到藏龙百瀑景区上空时，不慎掉下一棵仙草。着地生根长成现在的“白茶王”，当地百姓视白茶为圣灵。其二谓“仙水”，藏龙百瀑景区不但山涧泉水长年不止，而且岩石顶上不乏山泉，在“小梁山”顶上有一山泉，名为藏龙山泉，是天荒坪电站的唯一水源，也是上海人民的母亲河黄浦江的源头之一。其三谓“仙桃”，藏龙百瀑连绵的山核桃林上万亩，据《安吉志》记载，嘉靖十年间，安吉山核桃被征为朝廷贡品，其中藏龙百瀑的山核桃更为上品，成为衙门首选。其四谓“仙药”，据查藏龙百瀑景区内有珍稀药材近百种。尢以接骨木、野三七、金银花等闻名于世，相传明代名医李时珍曾到此采药。<br>藏龙百瀑集奇、特、险、幽、秀于一体，是原始生态与历史文化景观相结合的景区，藏龙百瀑将以崭新的面貌，期待着您的光临。",
                "province": "浙江",
                "city": "湖州"
            },
            {
                "name": "安吉中国大竹海",
                "content": "<P class=段落 align=left>安吉县位于浙江省西北部，全县面积1886平方公里，建县于东汉灵帝中平二年（公元185年），至今已经有1800多年历史，汉灵帝赐名“安吉”，取《诗经》“安且吉兮”。<P class=段落 align=left>这里是著名的中国竹乡、中国白茶之乡、中国转椅之乡，物华天宝、经济繁荣；<P class=段落 align=left>这里是一代宗师吴昌硕的故乡、远近闻名的中国民间艺术（书画）之乡，人杰地灵、文化灿烂；<P class=段落 align=left><P class=段落 align=left>这里是全国生态示范县、黄浦江源，环境一流、人居胜地；<P class=段落 align=left>这里是“长三角”经济圈腹地、投资创业的乐园，区位优越、交通便捷；<P class=段落 align=left>有世界上规模最大、品种最全的“竹子王国”安吉竹博园；有一碧万顷的“中国大竹海”；有雄伟壮观的天荒坪电站，有千年古刹灵峰寺，秀水青山、风光无限…… <P class=段落 align=left>一个日新月异的生态城市，一颗熠熠生辉的绿色明珠，一片流溢着生机与希望的土地，这里就是中国竹乡浙江省安吉县！",
                "province": "浙江",
                "city": "湖州"
            },
            {
                "name": "安吉龙王山",
                "content": "“上海母亲河”黄浦江源头之所在，位于安吉县章村镇南境。龙王山是安吉、临安、宁国两省三县的交界山，为“天目第一峰”。主峰海拔1587.5米。龙王山山势险要，植被丰满，动植物资源丰富，多奇峰异石和悬崖陡壁，有仙人洞、龙头瀑布、云龙飞瀑、水滴石穿、仙人锯板、水车岩等10余处景点。 <br>黄浦江源头坐落在浙江安吉龙王山自然保护区内，主峰1587.4米，是浙北、华东长江三角洲地区第一高峰。龙王山源自远古传说“龙生九子”。当年王母娘娘之女因思凡而下人间，与东海龙王三太子相爱而诞下九子；最后得王母娘娘赐予之神毯而造福凡间百姓。龙王山从此声名远扬。龙王山富有原始森林、峰岩涧溪、碧潭等自然景观，空气清新、水体纯净、环境幽雅得生态环境资源及山水风情、历史遗迹、神话传说等人文景观资源.<br>其特点为富、野、清、险、秀、旷；组合形成独特的“龙王九景”、黄浦江源、松峰天堑、幽峡仙踪等。春天满山遍野的樱花和杜鹃花、夏天千奇百怪的云海、秋天的满山红和冬天的冰雪世界是龙王山景观的四大“景点”。1999年经专家考察，龙王山被上海市地理学会论证确认为“黄浦江源”原上海市市长王道涵先生亲笔题名“黄浦江源”。龙王山蕴藏着丰富的生态环境资源，拥有156大种654属1400余种植物种类，仅浙江省植物分布新记录就有10种，国家一二级保护植物23种，观赏植物200种，药用植物162种。",
                "province": "浙江",
                "city": "湖州"
            }
        ],
        chosedsite:{},
        hotels:[
            {
                "picture": "http://m.tuniucdn.com/fb3/s1/2n9c/3N3EftjpfUzefffLBnyKXr8m2UcR.jpg",
                "englishName": "Zhouzhuang's recollection of Jiangnan Qingchan Inn",
                "price": 294,
                "address": "周庄镇福洪街72号",
                "starName": "经济型",
                "chineseName": "周庄忆江南清禅客栈",
                "star": 6,
                "longitude": 120.847863,
                "latitude": 31.112527,
                "hotelId": 1587331968,
                "facilities": [
                    3
                ]
            },
            {
                "picture": "http://m.tuniucdn.com/fb3/s1/2n9c/oyAcAyRghyCZ3gEJNoURHN6XFt2.jpg",
                "englishName": "Fragrans Hotel(Suzhou Lumu Metro Station Branch)",
                "price": 602,
                "address": "润元路润南巷172号，地铁二号线陆慕站东200米，近市旅游换乘中心北100米",
                "starName": "高档型",
                "chineseName": "斐利酒店(苏州陆慕地铁站店)",
                "star": 8,
                "longitude": 120.627635,
                "latitude": 31.353604,
                "hotelId": 2011294483,
                "facilities": [
                    3
                ]
            },
            {
                "picture": "http://m.tuniucdn.com/fb3/s1/2n9c/E5DPUZUSphGAqUTUrYksbb2pmME.jpg",
                "englishName": "Jinhao Guomao Hotel",
                "price": 276,
                "address": "金沙江路18号",
                "starName": "高档型",
                "chineseName": "常熟金豪国贸酒店",
                "star": 8,
                "longitude": 120.748685,
                "latitude": 31.654411,
                "hotelId": 2028555223,
                "facilities": [
                    3
                ]
            },
            {
                "picture": "http://m.tuniucdn.com/fb3/s1/2n9c/sPaATgzThmMYwwVkKCniWc5m4UE.jpg",
                "englishName": "Vienna International Hotel (Suzhou High-speed Railway North Station Xiangcheng Huangdai)",
                "price": 337,
                "address": "黄埭镇裴阳路1号",
                "starName": "高档型",
                "chineseName": "维也纳国际酒店(苏州高铁北站相城黄埭店)",
                "star": 8,
                "longitude": 120.551639,
                "latitude": 31.428576,
                "hotelId": 2024405004,
                "facilities": [
                    3
                ]
            }],
        shouldFetchSiteList: false, // 添加一个标志
    }),
    actions:{
        //
    },
    persist:true,
})